<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<!--Converted with LaTeX2HTML 2008 (1.71)
original version by:  Nikos Drakos, CBLU, University of Leeds
* revised and updated by:  Marcus Hennecke, Ross Moore, Herb Swan
* with significant contributions from:
  Jens Lippmann, Marek Rouchal, Martin Wilck and others -->
<HTML>
<HEAD>
<TITLE>Comparaci&#243;n de estructura terciaria entre prote&#237;nas</TITLE>
<META NAME="description" CONTENT="Comparaci&#243;n de estructura terciaria entre prote&#237;nas">
<META NAME="keywords" CONTENT="algoritmos3D">
<META NAME="resource-type" CONTENT="document">
<META NAME="distribution" CONTENT="global">

<META NAME="Generator" CONTENT="LaTeX2HTML v2008">
<META HTTP-EQUIV="Content-Style-Type" CONTENT="text/css">

<LINK REL="STYLESHEET" HREF="algoritmos3D.css">

<LINK REL="next" HREF="node33.html">
<LINK REL="previous" HREF="node31.html">
<LINK REL="up" HREF="node30.html">
<LINK REL="next" HREF="node33.html">
<!--google-->
<script type="text/javascript">

  var _gaq = _gaq || [];
  _gaq.push(['_setAccount', 'UA-22456715-1']);
  _gaq.push(['_trackPageview']);

  (function() {
    var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
    ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
    var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
  })();
</script>
</HEAD>

<BODY >

<DIV CLASS="navigation">
<A NAME="tex2html883"
  HREF="node31.html">
<IMG  ALIGN="BOTTOM" BORDER="0" ALT="previous"
 SRC="./icons//prev.png"></A> 
<A NAME="tex2html889"
  HREF="node30.html">
<IMG  ALIGN="BOTTOM" BORDER="0" ALT="up"
 SRC="./icons//up.png"></A> 
<A NAME="tex2html891"
  HREF="node33.html">
<IMG  ALIGN="BOTTOM" BORDER="0" ALT="next"
 SRC="./icons//next.png"></A> <div><fieldset>Siguiente: <b><A NAME="tex2html892"
  HREF="node33.html">Protein fold recognition</A></b>  Arriba: <b><A NAME="tex2html890"
  HREF="node30.html">Estructura terciaria</A></b>  Anterior: <b><A NAME="tex2html884"
  HREF="node31.html">Relaci&#243;n entre estructura primaria y</A></b></fieldset></div></DIV>
<!--End of Navigation Panel-->

<H1><A NAME="SECTION00520000000000000000"></A> <A NAME="compS3"></A>
<BR>
Comparaci&#243;n de estructura terciaria entre prote&#237;nas
</H1>

<P>
Volviendo a la observaci&#243;n anterior, el hecho de que la estructura terciaria est&#225; m&#225;s conservada que la secuencia
podemos aprovecharlo para buscar posibles relaciones filogen&#233;ticas remotas entre prote&#237;nas:

<P>

<UL>
<LI><SPAN  CLASS="textbf">PROBLEMA:</SPAN> disponemos de las coordenadas de dos prote&#237;nas A y B y queremos calcular cu&#225;nto se parecen
</LI>
<LI><SPAN  CLASS="textbf">SOLUCI&#211;N:</SPAN> buscar las subestructuras de m&#225;ximo tama&#241;o subA y subB que minimizan la distancia entre &#225;tomos equivalentes
</LI>
</UL>

<P>
Repasemos algunos algoritmos para calcular la similitud estructural entre prote&#237;nas
(hay alguno m&#225;s en la <A NAME="tex2html221"
  HREF="http://en.wikipedia.org/wiki/Structural_alignment">WikipediA</A>):

<UL>
<LI>bucle WHILE de alineamiento de secuencia + alineamiento estructural (<A NAME="tex2html222"
  HREF="http://www.compbio.dundee.ac.uk/downloads/stamp/">STAMP</A>)
</LI>
<LI>doble programaci&#243;n din&#225;mica (<A NAME="tex2html223"
  HREF="http://www.cathdb.info/cgi-bin/SsapServer.pl">SSAP</A>, m&#225;s detalles en este <A NAME="tex2html224"
  HREF="http://en.wikipedia.org/wiki/Structural_alignment#SSAP">enlace</A>)
</LI>
<LI>extensi&#243;n combinatoria de fragmentos alineados localmente (<A NAME="tex2html225"
  HREF="http://source.rcsb.org/jfatcatserver/ceHome.jsp">CE</A>)
</LI>
<LI>comparaci&#243;n de matrices de contactos (<A NAME="tex2html226"
  HREF="http://ekhidna.biocenter.helsinki.fi/dali_server">DALI</A>)
</LI>
<LI>alineamiento iterativo de fragmentos de  <i> backbone  </i> hasta converger en subconjunto equivalente &#243;ptimo 
(<A NAME="tex2html227"
  HREF="http://ub.cbm.uam.es/software/mammoth.php">MAMMOTH</A>, <A NAME="tex2html228"
  HREF="http://zhanglab.ccmb.med.umich.edu/TM-align">TM-ALIGN</A>)
</LI>
<LI>superposici&#243;n de factores de transcripci&#243;n para inferir el alineamiento correcto de sus sitios  <i> cis  </i> 
(<A NAME="tex2html229"
  HREF="http://floresta.eead.csic.es/tfcompare/">TFcompare</A>)
</LI>
</UL>

<P>

<DIV ALIGN="CENTER"><A NAME="fig:dali"></A><A NAME="2491"></A>
<TABLE>
<CAPTION ALIGN="BOTTOM"><STRONG>Figura 5.2:</STRONG>

Alineamiento DALI de matrices de distancias, tomado de <A
 HREF="node44.html#Holm2006">Holm <EM>et&nbsp;al.</EM> (2006)</A>.
</CAPTION>
<TR><TD>
<DIV ALIGN="CENTER">
<IMG
  WIDTH="229" HEIGHT="209" ALIGN="BOTTOM" BORDER="0"
 SRC="./dali.jpg"
 ALT="Image dali">

</DIV></TD></TR>
</TABLE>
</DIV>

<P>

<DIV ALIGN="CENTER"><A NAME="fig:tfcompare"></A><A NAME="2492"></A>
<TABLE>
<CAPTION ALIGN="BOTTOM"><STRONG>Figura 5.3:</STRONG>

Superposiciones de dominios de uni&#243;n a DNA de factores de transcripci&#243;n, que ponen de manifiesto 
su mecanismo, no siempre conservado, de reconocimiento de sus elementos CIS. Figura tomada de <A
 HREF="node44.html#Sebastian2013">Sebastian &amp; Contreras-Moreira (2013)</A>.
</CAPTION>
<TR><TD>
<DIV ALIGN="CENTER">
<IMG
  WIDTH="640" HEIGHT="413" ALIGN="BOTTOM" BORDER="0"
 SRC="./tfcompare.png"
 ALT="Image tfcompare">

</DIV></TD></TR>
</TABLE>
</DIV>

<P>
Adem&#225;s de &#233;stos, hay muchos otros programas disponibles para la comparaci&#243;n estructural de prote&#237;nas, 
y cada usuario tiene el suyo preferido. A qu&#233; se debe esto? 
La raz&#243;n es que no existe una definici&#243;n satisfactoria del alineamiento estructural correcto, 
que es en definitiva la funci&#243;n que todos estos algoritmos tratan de optimizar. De hecho, ni siquiera
est&#225; claro si las taxonom&#237;as estructurales cl&#225;sicas, 
como <A NAME="tex2html230"
  HREF="http://scop.berkeley.edu">SCOP</A>
o <A NAME="tex2html231"
  HREF="http://www.cathdb.info">CATH</A>,
son compatibles con la evidencia disponible sobre la evoluci&#243;n de los plegamientos ( <i> folds  </i>), que
actualmente se imagina como un proceso discreto s&#243;lo hasta cierto punto (<A NAME="tex2html893" target="contents"
  HREF="node44.html#Pascual2009">Pascual-Garc&#237;a <EM>et&nbsp;al.</EM>, 2009</A>; <A NAME="tex2html894" target="contents"
  HREF="node44.html#Sadowski2010">Sadowski &amp; Taylor, 2010</A>; <A NAME="tex2html895" target="contents"
  HREF="node44.html#Taylor2002">Taylor, 2002</A>).
Otra complicaci&#243;n adicional es que algunos plegamientos pueden verse como permutaciones circulares de elementos de estructura 
secundaria de otros (<A
 HREF="node44.html#Schmidt-Goenner2010">Schmidt-Goenner <EM>et&nbsp;al.</EM>, 2010</A>).

<P>
Lo habitual cuando se publica un nuevo m&#233;todo es compararlo con otros preexistentes. Estas comparaciones, 
si est&#225;n bien hechas y son realmente objetivas, pueden ayudar en la tarea de seleccionar un programa id&#243;neo 
para esta tarea. El algoritmo MAMMOTH (<A
 HREF="node44.html#Ortiz2002">Ortiz <EM>et&nbsp;al.</EM>, 2002</A>), con el que vamos a trabajar, se resume en estos pasos:
<BLOCKQUOTE>
1.- From the Calpha trace,  compute the unit-vector  U-RMS  between
 all pairs of heptapeptides of both model and experimental structure.
 The  U-RMS is  described  in:  Kedem, Chew &amp; Elber  (1999)  Proteins
 37(4):554-64,  and  in  Chew, Huttenlocher, Kedem &amp; Kleinberg (1999)
 J.Comp.Biol. 6, 313-325.  This is a measure sensitive  to  the local
 structure.
</BLOCKQUOTE>
<P>
<BLOCKQUOTE>2.- Use the matrix derived in step 1 to find and alignment of local
 structures that maximizes the local similarity of both the model and
 the  experimental structure. For that, use a global alignment method 
 with  zero  end  gaps,  as  described  in  Needleman &amp; Wunsch (1970) 
 J.Mol.Biol. 48, 443-453.
</BLOCKQUOTE>
<P>
<BLOCKQUOTE>3.- Find the maximum subset of similar  local  structures that have
 their corresponding  Calphas  close  in  cartesian space. "Close" is
 considered here  as  a distance less or equal than 4.0 A. The method
 to  find this subset is a small variant of the MaxSub algorithm from
 the  Fischer  group:  Siew,  Elofsson,  Rychlewski  &amp; Fischer (2000)
 Bioinformatics, in press.
</BLOCKQUOTE>
<P>
<BLOCKQUOTE>4.- Obtain  the  probability  of  obtaining the given proportion of
 aligned residues (with respect to the  shortest  protein  model)  by
 chance.  This  metric  (E-value) is then used as the final score (or 
 the  corresponding Z-score, both are equivalent for gaussian distri-
 butions, however the Z-score is a more manegable index). In order to
 obtain this  value, an approach similar to that of Levitt &amp; Gerstein 
 (1998) PNAS 95, 5913 is used, as  described  in  Abagyan  &amp;  Batalov 
 (1997) J.Mol.Biol. 273, 355-368.  The E-value estimation is based on
 extreme-value fitting.  In  a  test  set  with the SCOP database, it 
 shows rather good performance.

</BLOCKQUOTE>

<P>
Y ha sido comparado con varios m&#233;todos, como se ve en esta figura:  

<P>

<DIV ALIGN="CENTER"><A NAME="fig:mammoth"></A><A NAME="2493"></A>
<TABLE>
<CAPTION ALIGN="BOTTOM"><STRONG>Figura 5.4:</STRONG>

Similitud de MAMMOTH con otros algoritmos de comparaci&#243;n de estructura de prote&#237;nas, 
incluyendo el criterio de un experto humano (Murzin), tomada de (<A
 HREF="node44.html#Ortiz2002">Ortiz <EM>et&nbsp;al.</EM>, 2002</A>).
</CAPTION>
<TR><TD>
<DIV ALIGN="CENTER">
<IMG
  WIDTH="675" HEIGHT="593" ALIGN="BOTTOM" BORDER="0"
 SRC="./mammoth_bench.jpg"
 ALT="Image mammoth_bench">

</DIV></TD></TR>
</TABLE>
</DIV>

<P>
En mi opini&#243;n MAMMOTH es junto con DALI y CE de los mejores programas, 
porque adem&#225;s de generar superposiciones y alineamientos satisfactorios, 
sus medidas num&#233;ricas de similitud devuelven valores que se ajustan a
la evaluaci&#243;n visual que cualquier usuario hace de una superposici&#243;n.
En concreto, MAMMOTH devuelve para cada alineamiento una puntuaci&#243;n y su valor esperado asociado ( <i> E-value  </i>),
que podemos interpretar de manera an&#225;loga a los valores esperados de BLAST, superando las limitaciones del RMSD para 
comparar estructuras que solamente se parecen en algunas regiones (<A
 HREF="node44.html#Siew2000">Siew <EM>et&nbsp;al.</EM>, 2000</A>).

<P>
Sin embargo, dada la dificultad te&#243;rica del problema, hay una gran variedad de software 
para esta tarea, como se muestra en esta <A NAME="tex2html232"
  HREF="http://en.wikipedia.org/wiki/Structural_alignment_software">lista de la WikipediA</A>.

<P>
Para aprender a hacer alineamientos/superposiciones estructurales, y a interpretarlos, podemos hacer este ejercicio:

<P>

<UL>
<LI>Visita <A NAME="tex2html233"
  HREF="http://scop.berkeley.edu">SCOP</A>, 
elige una clase
y selecciona un grupo de 5 estructuras de prote&#237;nas que pertenezcan a la misma superfamilia, para despu&#233;s

<UL>
<LI>descargar los archivos PDB correspondientes,que contienen las coordenadas at&#243;micas,  del
<A NAME="tex2html234"
  HREF="http://www.rcsb.org/pdb">Protein Data Bank</A>
y
</LI>
<LI>compara al menos una pareja de estructuras con MAMMOTH e inspecciona los archivos de salida generados (<code>maxsub_sup.pdb,maxsub_sup2.pdb,rasmol.tcl</code>)
</LI>
<LI>(el ejecutable se encuentra en <code>/home/compu2/algoritmos3D/soft/mammoth-1.0-src</code>)
</LI>
</UL>

<P>
</LI>
<LI>Visualiza la superposici&#243;n generada,  con Rasmol (usando la opci&#243;n <code> -script rasmol.tcl</code>) y con PyMOL

<P>
</LI>
<LI>Prueba MAMMOTH con el fin de comparar una estructura problema (una de las 5) contra una biblioteca
de estructuras en formato PDB (las otras 4), como si fuera BLAST. Cu&#225;l de las 4 estructuras ser&#237;a el mejor molde o  <i> template  </i>)
Cu&#225;l es el l&#237;mite esperado de precisi&#243;n, en t&#233;rminos de RMSD, que alcanzar&#237;amos con cada molde?

<P>
</LI>
<LI>Calcula para algunas de las superposiciones el <A NAME="tex2html235"
  HREF="http://zhanglab.ccmb.med.umich.edu/TM-score/">TM-score</A>, 
seg&#250;n se define en <A
 HREF="node44.html#Zhang2004">Zhang &amp; Skolnick (2004)</A>.

<P>
</LI>
</UL>

<DIV CLASS="navigation"><hr> 
<A NAME="tex2html883"
  HREF="node31.html">
<IMG  ALIGN="BOTTOM" BORDER="0" ALT="previous"
 SRC="./icons//prev.png"></A> 
<A NAME="tex2html889"
  HREF="node30.html">
<IMG  ALIGN="BOTTOM" BORDER="0" ALT="up"
 SRC="./icons//up.png"></A> 
<A NAME="tex2html891"
  HREF="node33.html">
<IMG  ALIGN="BOTTOM" BORDER="0" ALT="next"
 SRC="./icons//next.png"></A> </DIV>
<!--End of Navigation Panel-->
<ADDRESS>
<a href="http://hdl.handle.net/10261/21892">PDF</a><br>Bruno Contreras-Moreira<br><a href="http://www.eead.csic.es/compbio">http://www.eead.csic.es/compbio</a>
</ADDRESS>
</BODY>
</HTML>
