<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<!--Converted with LaTeX2HTML 2018.2 (Released May 16, 2018) -->
<HTML>
<HEAD>
<TITLE>Comparaci&#243;n de estructura terciaria entre prote&#237;nas</TITLE>
<META NAME="description" CONTENT="Comparaci&#243;n de estructura terciaria entre prote&#237;nas">
<META NAME="keywords" CONTENT="algoritmos3D">
<META NAME="resource-type" CONTENT="document">
<META NAME="distribution" CONTENT="global">

<META NAME="Generator" CONTENT="LaTeX2HTML v2018.2">
<META HTTP-EQUIV="Content-Style-Type" CONTENT="text/css">

<LINK REL="STYLESHEET" HREF="algoritmos3D.css">

<LINK REL="next" HREF="node34.html">
<LINK REL="previous" HREF="node32.html">
<LINK REL="up" HREF="node32.html">
<LINK REL="next" HREF="node34.html">
<!--google-->
<script type="text/javascript">

  var _gaq = _gaq || [];
  _gaq.push(['_setAccount', 'UA-22456715-1']);
  _gaq.push(['_trackPageview']);

  (function() {
    var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
    ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
    var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
  })();
</script>
</HEAD>

<BODY >

<DIV CLASS="navigation">
<A NAME="tex2html1039"
  HREF="node32.html">
<IMG  ALIGN="BOTTOM" BORDER="0" ALT="previous"
 SRC="./icons//prev.png"></A> 
<A NAME="tex2html1045"
  HREF="node32.html">
<IMG  ALIGN="BOTTOM" BORDER="0" ALT="up"
 SRC="./icons//up.png"></A> 
<A NAME="tex2html1047"
  HREF="node34.html">
<IMG  ALIGN="BOTTOM" BORDER="0" ALT="next"
 SRC="./icons//next.png"></A> <div><fieldset>Siguiente: <b><A NAME="tex2html1048"
  HREF="node34.html">Protein fold recognition</A></b>  Arriba: <b><A NAME="tex2html1046"
  HREF="node32.html">Estructura terciaria</A></b>  Anterior: <b><A NAME="tex2html1040"
  HREF="node32.html">Estructura terciaria</A></b></fieldset></div></DIV>
<!--End of Navigation Panel-->

<H1><A NAME="SECTION00510000000000000000"></A> <A NAME="compS3"></A>
<BR>
Comparaci&#243;n de estructura terciaria entre prote&#237;nas
</H1>

<P>
El hecho de que la estructura terciaria est&#225; m&#225;s conservada que la secuencia (ver secci&#243;n <A HREF="node12.html#3dcons">1.3.5</A>)
podemos aprovecharlo para buscar posibles relaciones filogen&#233;ticas remotas entre prote&#237;nas:

<P>

<UL>
<LI><SPAN  CLASS="textbf">PROBLEMA:</SPAN> disponemos de las coordenadas de dos prote&#237;nas A y B y queremos calcular cu&#225;nto se parecen sus estructuras
</LI>
<LI><SPAN  CLASS="textbf">SOLUCI&#211;N:</SPAN> buscar las subestructuras de m&#225;ximo tama&#241;o subA y subB que minimizan la distancia entre &#225;tomos equivalentes 
(ver secci&#243;n <A HREF="node12.html#3dcons">1.3.5</A>)
</LI>
</UL>

<P>
Repasemos algunos algoritmos fundamentales para calcular la similitud estructural entre parejas de prote&#237;nas
(hay alguno m&#225;s en la <A NAME="tex2html249"
  HREF="http://en.wikipedia.org/wiki/Structural_alignment">WikipediA</A>):

<UL>
<LI>Alineamiento estructural iterativo (<A NAME="tex2html250"
  HREF="http://www.compbio.dundee.ac.uk/downloads/stamp/">STAMP</A>). 
El primer borrador de alineamiento se calcula con ayuda de  matrices de sustituci&#243;n de amino&#225;cidos como 
<A NAME="tex2html251"
  HREF="https://en.wikipedia.org/wiki/BLOSUM">BLOSUM</A>. &#201;ste sirve para calcular la superposici&#243;n correspondiente y 
permite refinar el conjunto de residuos equivalentes, aquellos por debajo de cierto umbral de distancia.
Estas iteraciones de alineamiento y definici&#243;n de sobconjuntos de residuos equivalentes se repiten hasta que convergen y 
el RMSD no mejora (ver <A
 HREF="node50.html#Chothia1986">Chothia &amp; Lesk (1986)</A> y secci&#243;n <A HREF="node12.html#3dcons">1.3.5</A>).

<P>
</LI>
<LI>Doble programaci&#243;n din&#225;mica para primero) establecer fragmentos localmente similares entre ambas estructuras y 
segundo) estimar el subconjunto de fragmentos que producen una superposici&#243;n &#243;ptima 
(<A NAME="tex2html252"
  HREF="http://sillitoe.cathdb.info/tools/cath-ssap">SSAP</A>). 
M&#225;s detalles en este <A NAME="tex2html253"
  HREF="http://en.wikipedia.org/wiki/Structural_alignment#SSAP">enlace</A>).

<P>
</LI>
<LI>Comparaci&#243;n de matrices de contactos/distancias (<A NAME="tex2html254"
  HREF="http://ekhidna.biocenter.helsinki.fi/dali_server">DALI</A>).
En vez de trabajar con p&#233;ptidos en 3D, algo que requiere calcular rotaciones y transforamciones, 
esta familia de m&#233;todos primero convierten cada estructura a su matriz de distancias correspondiente,
para luego compararlas entre si.

<P>
</LI>
<LI>Minimizaci&#243;n de la informaci&#243;n requerida para reconstruir las coordenadas de una estructura dadas las de la otra
(<A NAME="tex2html255"
  HREF="http://lcb.infotech.monash.edu.au/mmligner">mmligner</A>). La virtud de este aproximaci&#243;n es que prescinde 
de la elecci&#243;n subjetiva de umbrales y define de manera precisa la superposici&#243;n &#243;ptima.

<P>
</LI>
<LI>Superposici&#243;n de factores de transcripci&#243;n para deducir el alineamiento correcto de sus sitios  <i> cis  </i> 
(<A NAME="tex2html256"
  HREF="http://floresta.eead.csic.es/tfcompare/">TFcompare</A>)

<P>
</LI>
</UL>

<P>
Puedes ampliar detalles de estos algoritmos en <A
 HREF="node50.html#pascual_garcia_alberto_2014_1066346">Pascual-Garc&#237;a (2014a)</A>.

<P>

<DIV ALIGN="CENTER"><A NAME="fig:dali"></A><A NAME="3142"></A>
<TABLE>
<CAPTION ALIGN="BOTTOM"><STRONG>Figura 5.1:</STRONG>

Tres estrategias (r&#237;gida, flexible y el&#225;stica) para comparar la estructura terciaria de dos prote&#237;nas 
con dos dominios (c&#237;rculos) con 4 residuos cada uno, separados por una secuencia de longitud variable.
Arriba derecha: la superposici&#243;n r&#237;gida tiene dos opciones: alinear un total de 5 residuos equivalentes (<SPAN CLASS="MATH"><IMG
 WIDTH="27" HEIGHT="34" ALIGN="MIDDLE" BORDER="0"
 SRC="img9.png"
 ALT="$Ne$"></SPAN>) con RMSD bajo 
o alinear todos (<SPAN CLASS="MATH"><IMG
 WIDTH="60" HEIGHT="34" ALIGN="MIDDLE" BORDER="0"
 SRC="img10.png"
 ALT="$Ne=8$"></SPAN>) con un RMSD alto. 
Abajo izquierda: una superposici&#243;n flexible rompe la estructura larga en dos subestucturas para optimizar el RMSD sobre 4 residuos en cada dominio.
Abajo derecha: la comparaci&#243;n de matrices de distancias permite alinear ambos dominios maximizando <SPAN CLASS="MATH"><IMG
 WIDTH="27" HEIGHT="34" ALIGN="MIDDLE" BORDER="0"
 SRC="img9.png"
 ALT="$Ne$"></SPAN>.
Figura tomada de <A
 HREF="node50.html#Hasegawa2009">Hasegawa &amp; Holm (2009)</A> y reproducida con permiso.
</CAPTION>
<TR><TD>
<DIV ALIGN="CENTER">
<IMG
  WIDTH="510" HEIGHT="328" ALIGN="BOTTOM" BORDER="0"
 SRC="./3Dsuper.jpg"
 ALT="Image 3Dsuper">

</DIV></TD></TR>
</TABLE>
</DIV>

<P>

<DIV ALIGN="CENTER"><A NAME="fig:tfcompare"></A><A NAME="3143"></A>
<TABLE>
<CAPTION ALIGN="BOTTOM"><STRONG>Figura 5.2:</STRONG>

Superposiciones de dominios de uni&#243;n a DNA (DBD) de factores de transcripci&#243;n, que ponen de manifiesto 
su mecanismo, no siempre conservado, de reconocimiento de sus cis-elementos (DBS). 
Figura tomada de <A
 HREF="node50.html#Sebastian2013">Sebastian &amp; Contreras-Moreira (2013)</A>.
</CAPTION>
<TR><TD>
<DIV ALIGN="CENTER">
<IMG
  WIDTH="640" HEIGHT="413" ALIGN="BOTTOM" BORDER="0"
 SRC="./tfcompare.png"
 ALT="Image tfcompare">

</DIV></TD></TR>
</TABLE>
</DIV>

<P>
Hay disponibles muchos otros programas disponibles para la comparaci&#243;n estructural de prote&#237;nas, 
y cada usuario tiene el suyo preferido. A qu&#233; se debe esto? 
La raz&#243;n es que no existe una definici&#243;n totalmente satisfactoria del alineamiento estructural correcto, 
que es en definitiva la funci&#243;n que todos estos algoritmos tratan de optimizar. De hecho, ni siquiera
est&#225; claro si las taxonom&#237;as estructurales cl&#225;sicas, 
como <A NAME="tex2html257"
  HREF="http://www.cathdb.info">CATH</A>
o
<A NAME="tex2html258"
  HREF="http://scop.berkeley.edu">SCOP</A>
(<A
 HREF="node50.html#Csaba2009">Csaba <EM>et&nbsp;al.</EM>, 2009</A>),
son compatibles con la evidencia disponible sobre la evoluci&#243;n de los plegamientos ( <i> folds  </i>), que
actualmente se imagina como un proceso discreto s&#243;lo hasta cierto punto (<A NAME="tex2html1049" target="contents"
  HREF="node50.html#Taylor2002">Taylor, 2002</A>; <A NAME="tex2html1050" target="contents"
  HREF="node50.html#Sadowski2010">Sadowski &amp; Taylor, 2010</A>; <A NAME="tex2html1051" target="contents"
  HREF="node50.html#Pascual2009">Pascual-Garc&#237;a <EM>et&nbsp;al.</EM>, 2009</A>; <A NAME="tex2html1052" target="contents"
  HREF="node50.html#Andreeva2014">Andreeva <EM>et&nbsp;al.</EM>, 2014</A>). 
De hecho <A NAME="tex2html259"
  HREF="http://scop2.mrc-lmb.cam.ac.uk/">SCOP2</A>
se hizo para superar esas limitaciones.
Otra complicaci&#243;n adicional es que algunos plegamientos pueden verse como permutaciones circulares de elementos de estructura 
secundaria de otros (<A
 HREF="node50.html#Schmidt-Goenner2010">Schmidt-Goenner <EM>et&nbsp;al.</EM>, 2010</A>).

<P>
A pesar de estas dificultades, en general aceptamos que cada superfamilia de prote&#237;nas es un <SPAN  CLASS="textbf">cl&#250;ster</SPAN>
de estructuras muy similares, que se pueden superponer aunque su secuencia sea muy diferente, 
y que cada plegamiento es un subconjunto de superfamilias que comparten una topolog&#237;a de estructura secundaria.

<P>
Lo habitual cuando se publica un nuevo m&#233;todo es compararlo con otros preexistentes. Estas comparaciones, 
si son rigurosas y reproducibles, pueden ayudar en la tarea de seleccionar un programa id&#243;neo 
para esta tarea. El algoritmo MAMMOTH, con el que vamos a trabajar, se resume en estos pasos, 
en palabras textuales de sus autores (<A
 HREF="node50.html#Ortiz2002">Ortiz <EM>et&nbsp;al.</EM>, 2002</A>):
<BLOCKQUOTE>
1.- From the Calpha trace,  compute the unit-vector  U-RMS  between
 all pairs of heptapeptides of both model and experimental structure.
 The  U-RMS is  described  in:  Kedem, Chew &amp; Elber  (1999)  Proteins
 37(4):554-64,  and  in  Chew, Huttenlocher, Kedem &amp; Kleinberg (1999)
 J.Comp.Biol. 6, 313-325.  This is a measure sensitive  to  the local
 structure.
</BLOCKQUOTE>
<P>
<BLOCKQUOTE>2.- Use the matrix derived in step 1 to find and alignment of local
 structures that maximizes the local similarity of both the model and
 the  experimental structure. For that, use a global alignment method 
 with  zero  end  gaps,  as  described  in  Needleman &amp; Wunsch (1970) 
 J.Mol.Biol. 48, 443-453.
</BLOCKQUOTE>
<P>
<BLOCKQUOTE>3.- Find the maximum subset of similar  local  structures that have
 their corresponding  Calphas  close  in  cartesian space. "Close" is
 considered here  as  a distance less or equal than 4.0 A. The method
 to  find this subset is a small variant of the MaxSub algorithm from
 the  Fischer  group:  Siew,  Elofsson,  Rychlewski  &amp; Fischer (2000)
 Bioinformatics, in press.
</BLOCKQUOTE>
<P>
<BLOCKQUOTE>4.- Obtain  the  probability  of  obtaining the given proportion of
 aligned residues (with respect to the  shortest  protein  model)  by
 chance.  This  metric  (E-value) is then used as the final score (or 
 the  corresponding Z-score, both are equivalent for gaussian distri-
 butions, however the Z-score is a more manegable index). In order to
 obtain this  value, an approach similar to that of Levitt &amp; Gerstein 
 (1998) PNAS 95, 5913 is used, as  described  in  Abagyan  &amp;  Batalov 
 (1997) J.Mol.Biol. 273, 355-368.  The E-value estimation is based on
 extreme-value fitting.  In  a  test  set  with the SCOP database, it 
 shows rather good performance.

</BLOCKQUOTE>

<P>
MAMMOTH fue comparado con varios m&#233;todos, como se ve en esta figura:  

<P>

<DIV ALIGN="CENTER"><A NAME="fig:mammoth"></A><A NAME="3145"></A>
<TABLE>
<CAPTION ALIGN="BOTTOM"><STRONG>Figura 5.3:</STRONG>

Semejanza de MAMMOTH respecto a otros algoritmos de comparaci&#243;n de estructura de prote&#237;nas, 
incluyendo el criterio de un experto humano (Murzin). Figura tomada de <A
 HREF="node50.html#Ortiz2002">Ortiz <EM>et&nbsp;al.</EM> (2002)</A>. Copyright (2002) Protein Science.
</CAPTION>
<TR><TD>
<DIV ALIGN="CENTER">
<IMG
  WIDTH="675" HEIGHT="593" ALIGN="BOTTOM" BORDER="0"
 SRC="./mammoth_bench.jpg"
 ALT="Image mammoth_bench">

</DIV></TD></TR>
</TABLE>
</DIV>

<P>
MAMMOTH es junto con DALI de los mejores programas, porque adem&#225;s de generar superposiciones y alineamientos satisfactorios, 
sus medidas num&#233;ricas de similitud devuelven valores que se ajustan a la evaluaci&#243;n visual de la superposici&#243;n obtenida.
En concreto, MAMMOTH devuelve para cada alineamiento una puntuaci&#243;n y su valor esperado asociado ( <i> E-value  </i>),
que podemos interpretar de manera an&#225;loga a los valores esperados de BLAST, superando las limitaciones del RMSD para 
comparar estructuras que solamente se parecen en algunas regiones (<A
 HREF="node50.html#Siew2000">Siew <EM>et&nbsp;al.</EM>, 2000</A>). 
Adem&#225;s, hay una versi&#243;n de MAMMOTH que permite calcular 
<A NAME="tex2html260"
  HREF="https://ub.cbm.uam.es/software/mammothm.php">alineamientos m&#250;ltiples</A>.

<P>
Para superar las limitaciones del RMSD, que da el mismo peso a regiones del core que a regiones divergentes, 
<A
 HREF="node50.html#Zhang2004">Zhang &amp; Skolnick (2004)</A> propusieron otra funci&#243;n, el TM-score, que disminuye el peso de las parejas alineadas a mayor distancia, es menos sensible
a la longitud de las estructuras comparadas y toma valores entre 0 y 1: 

<P>
<P></P>
<DIV ALIGN="CENTER" CLASS="mathdisplay"><!-- MATH
 \begin{equation}
TMscore = max[  \frac{1}{L_{Q}}  \sum_{i=1}^{L_{T}} \frac{1}{ 1 + (\frac{d_{i}}{d_{0}})^{2} } ]
\end{equation}
 -->
<TABLE CLASS="equation" CELLPADDING="0" WIDTH="100%" ALIGN="CENTER">
<TR VALIGN="MIDDLE">
<TD NOWRAP ALIGN="CENTER"><SPAN CLASS="MATH"><IMG
 WIDTH="267" HEIGHT="72" ALIGN="MIDDLE" BORDER="0"
 SRC="img70.png"
 ALT="$\displaystyle TMscore = max[ \frac{1}{L_{Q}} \sum_{i=1}^{L_{T}} \frac{1}{ 1 + (\frac{d_{i}}{d_{0}})^{2} } ]$"></SPAN></TD>
<TD NOWRAP CLASS="eqno" WIDTH="10" ALIGN="RIGHT">
(<SPAN CLASS="arabic">5</SPAN>.<SPAN CLASS="arabic">1</SPAN>)</TD></TR>
</TABLE></DIV>
<BR CLEAR="ALL"><P></P> 

<P>
Aqu&#237; <SPAN CLASS="MATH"><IMG
 WIDTH="37" HEIGHT="34" ALIGN="MIDDLE" BORDER="0"
 SRC="img71.png"
 ALT="$max$"></SPAN> es el valor m&#225;ximo obtenido en todas las superposiciones calculadas, 
<SPAN CLASS="MATH"><IMG
 WIDTH="27" HEIGHT="34" ALIGN="MIDDLE" BORDER="0"
 SRC="img72.png"
 ALT="$L_{Q}$"></SPAN> es la longitud de la estructura Q o  <i> query  </i>, 
<SPAN CLASS="MATH"><IMG
 WIDTH="26" HEIGHT="34" ALIGN="MIDDLE" BORDER="0"
 SRC="img73.png"
 ALT="$L_{T}$"></SPAN> es el total de residuos alineados a la estructura T o  <i> template  </i>, 
<SPAN CLASS="MATH"><IMG
 WIDTH="19" HEIGHT="34" ALIGN="MIDDLE" BORDER="0"
 SRC="img74.png"
 ALT="$d_{i}$"></SPAN> es la distancia entre la pareja <SPAN CLASS="MATH"><IMG
 WIDTH="10" HEIGHT="34" ALIGN="MIDDLE" BORDER="0"
 SRC="img75.png"
 ALT="$i$"></SPAN> de residuos y 
<SPAN CLASS="MATH"><IMG
 WIDTH="22" HEIGHT="34" ALIGN="MIDDLE" BORDER="0"
 SRC="img76.png"
 ALT="$d_{0}$"></SPAN> el factor de escala para normalizar por longitud de secuencia. 

<P>
Para calcularlo de manera &#243;ptima podemos usar su algoritmo TM-align (<A
 HREF="node50.html#Zhang2005">Zhang &amp; Skolnick, 2005</A>), cuyo c&#243;digo fuente esta disponible en 
<A NAME="tex2html261"
  HREF="http://zhanglab.ccmb.med.umich.edu/TM-align/TM-align-C/TMalignc.tar.gz">TMalignc.tar.gz</A>. La funci&#243;n TM-score
se ha convertido en el est&#225;ndar para medir el parecido entre estructuras, ya que se acepta que un valor de 0.5 garantiza un plegamiento similar.

<P>
De todos modos, hay una gran variedad de software para esta tarea, 
como se muestra por ejemplo en esta <A NAME="tex2html262"
  HREF="http://en.wikipedia.org/wiki/Structural_alignment_software">lista de la WikipediA</A>.

<P>
Para aprender a hacer alineamientos/superposiciones estructurales, y a interpretarlos, podemos hacer este ejercicio:

<P>

<UL>
<LI>Visita <A NAME="tex2html263"
  HREF="http://scop.berkeley.edu">SCOPe</A>, 
elige una clase (ver figura <A HREF="node10.html#fig:foldclassif">1.23</A>)
y selecciona un grupo de 5 estructuras de prote&#237;nas que pertenezcan a la misma superfamilia, para despu&#233;s

<UL>
<LI>descargar los archivos PDB correspondientes,que contienen las coordenadas at&#243;micas,  del
<A NAME="tex2html264"
  HREF="http://www.rcsb.org/pdb">Protein Data Bank</A>
y
</LI>
<LI>compara al menos una pareja de estructuras con MAMMOTH e inspecciona los archivos de salida generados (<code>maxsub_sup.pdb,maxsub_sup2.pdb,rasmol.tcl</code>)
</LI>
<LI>(el ejecutable se encuentra en <code>/home/compu2/algoritmos3D/soft/mammoth-1.0-src</code>)
</LI>
</UL>

<P>
</LI>
<LI>Visualiza la superposici&#243;n generada,  con Rasmol (usando la opci&#243;n <code> -script rasmol.tcl</code>) y con PyMOL

<P>
</LI>
<LI>Puedes probar a superponer estructuras directamente en <A NAME="tex2html265"
  HREF="https://pymol.org/dokuwiki/doku.php?id=command:align">PyMOL</A>
<P>
</LI>
<LI>Prueba MAMMOTH con el fin de comparar una estructura problema (una de las 5) contra una biblioteca
de estructuras en formato PDB (las otras 4), como si fuera BLAST. Cu&#225;l de las 4 estructuras ser&#237;a el mejor molde o  <i> template  </i>)
Cu&#225;l es el l&#237;mite esperado de precisi&#243;n, en t&#233;rminos de RMSD, que alcanzar&#237;amos con cada molde?

<P>
</LI>
<LI>Calcula para algunas de las superposiciones el <A NAME="tex2html266"
  HREF="http://zhanglab.ccmb.med.umich.edu/TM-score/">TM-score</A>.

<P>
</LI>
</UL>

<DIV CLASS="navigation"><hr> 
<A NAME="tex2html1039"
  HREF="node32.html">
<IMG  ALIGN="BOTTOM" BORDER="0" ALT="previous"
 SRC="./icons//prev.png"></A> 
<A NAME="tex2html1045"
  HREF="node32.html">
<IMG  ALIGN="BOTTOM" BORDER="0" ALT="up"
 SRC="./icons//up.png"></A> 
<A NAME="tex2html1047"
  HREF="node34.html">
<IMG  ALIGN="BOTTOM" BORDER="0" ALT="next"
 SRC="./icons//next.png"></A> </DIV>
<!--End of Navigation Panel-->
<ADDRESS>
<a href="http://hdl.handle.net/10261/21892">PDF</a><br>Contreras-Moreira,B. (2018) Algoritmos en bioinform&aacute;tica estructural. <a href="https://doi.org/10.20350/digitalcsic/8544">doi:10.20350/digitalcsic/8544</a><br><a href="http://www.eead.csic.es/compbio">http://www.eead.csic.es/compbio</a>
</ADDRESS>
</BODY>
</HTML>
